[
  {
    "id": "gaming_001",
    "company": "Freaks 4U Gaming",
    "role": "Senior Project Manager",
    "industry": "gaming/esports",
    "date": "2025-12-18",
    "status": "pending",
    "letter": "Charles Siboto\nNeu-Eichenberg, Germany\ncsiboto@gmail.com\n+49 176 8787 3255\n\n18 December 2025\n\nDear Hiring Manager,\n\nI am writing to express my strong interest in the Senior Project Manager position at Freaks 4U Gaming. With over ten years of experience in project management across publishing, digital media and education, combined with a lifelong passion for gaming that began with the PlayStation 1, I am excited about the opportunity to lead projects in the dynamic world of esports.\n\nThroughout my career, I have consistently delivered complex projects on time and within scope. At Jonathan Ball Publishers, I managed the complete lifecycle of 20+ book titles annually, coordinating cross-functional teams, maintaining rigorous documentation, and ensuring quality standards were exceeded. These experiences have refined my ability to balance structured delivery with creative energy and to communicate effectively with stakeholders at all levels.\n\nCoaching and developing colleagues is central to my professional approach. At ASC Göttingen, I improved language proficiency by 30% through tailored courses for 40 colleagues. I recently completed an AI Project Management bootcamp at neuefische GmbH / SPICED Academy, where I deepened my expertise in Agile Scrum methodology, Design Thinking principles and project management tools.\n\nGaming is more than entertainment to me. It is a storytelling engine, a global community and a space for cultural innovation. I would be honoured to contribute to that vision.\n\nI am available from 01 February 2026, and my salary expectation is in the range of €52,000 to €58,000 annually.\n\nWarm regards,\n\nCharles Siboto"
  },
  {
    "id": "gaming_002",
    "company": "Nintendo of Europe",
    "role": "(Associate) Localisation Producer (Software and Audio)",
    "industry": "gaming/AAA",
    "date": "2026-01-21",
    "status": "rejected",
    "cv_version": "Localisation & Project Management Professional",
    "notes": "AAA gaming extremely competitive - no shipped titles",
    "letter": "Charles Siboto\nNeu-Eichenberg, Germany\ncsiboto@gmail.com\n+49 176 8787 3255\nlinkedin.com/in/charlessiboto-2a9a773b\n\n21 January 2026\n\nDear Hiring Team,\n\nI am writing to apply for the (Associate) Localisation Producer (Software and Audio) position at Nintendo of Europe. As a lifelong Nintendo fan whose journey began with the Game Boy and The Legend of Zelda: Link's Awakening, I am genuinely excited by the opportunity to contribute to the localisation of games that have brought joy to millions. With over ten years of experience in publishing project management and localisation oversight, I believe I can help Nintendo continue putting smiles on faces around the world.\n\nMy career has been built on delivering complex projects on time, within budget and to the highest quality standards. At Jonathan Ball Publishers, I managed 20+ book titles annually through the complete production lifecycle, coordinating cross-functional teams, controlling budgets and ensuring all deliverables met quality benchmarks. At NB Publishers, I oversaw translation and co-production projects with international publishing partners, managing the localisation of content across multiple languages while maintaining brand consistency and cultural resonance. This experience has given me a strong foundation in the planning, monitoring and stakeholder negotiation that this role requires.\n\nI bring excellent communication skills and experience guiding teams. At ASC Göttingen, I developed and delivered English training courses for 40 colleagues, improving language proficiency by 30% through a structured, learner-centred approach. I am comfortable distributing project information clearly, resolving issues proactively and representing organisational interests in negotiations. My analytical mindset and process-oriented approach have consistently helped me identify bottlenecks and implement solutions that keep projects on track.\n\nI want to be transparent: while I have editorial and content production experience, my hands-on experience with DAW software like Pro Tools is limited. However, I am a dedicated and quick learner with a genuine passion for audio and gaming. I have followed Nintendo's approach to localisation with admiration—from the voice acting in Breath of the Wild to the character-driven audio in Animal Crossing—and I am eager to develop technical audio skills as part of this role. My recent AI Project Management training at neuefische GmbH has reinforced my ability to rapidly acquire new technical competencies.\n\nHaving lived in Germany since 2018, I am fluent in the working culture and comfortable operating in both English and German. I bring a proactive, positive attitude and a strong work ethic—qualities I understand are valued at Nintendo. The opportunity to work on localisation for a company whose games have shaped my love of storytelling would be genuinely meaningful to me.\n\nI am available to start from 1 March 2026, and my salary expectation is in the range of €50,000 to €55,000 annually. Thank you for considering my application. I would welcome the opportunity to discuss how my project management expertise and passion for Nintendo can contribute to your localisation team.\n\nWarm regards,\n\nCharles Siboto"
  },
  {
    "id": "streaming_001",
    "company": "Netflix",
    "role": "Product Language Manager, DACH",
    "industry": "streaming/tech",
    "date": "2026-01-16",
    "status": "applied",
    "cv_version": "Product Language Manager",
    "letter": "Charles Siboto\nNeu-Eichenberg, Germany\ncsiboto@gmail.com\n+49 176 8787 3255\nlinkedin.com/in/charlessiboto-2a9a773b\n\n16 January 2026\n\nDear Hiring Team,\n\nI am writing to apply for the Product Language Manager, DACH position at Netflix. With a degree in Language Practice, over ten years of editorial and publishing experience, advanced German fluency gained through seven years living and working in Germany, and recent training in AI and machine learning technologies, I am excited by the opportunity to help Netflix deliver language experiences that feel authentically local to members in Germany, Austria and Switzerland.\n\nMy career has been built on linguistic precision and cultural sensitivity. At Jonathan Ball Publishers and NB Publishers, I developed and maintained editorial standards, style guides and quality frameworks across hundreds of titles. I oversaw translation and localisation projects with international publishing partners, ensuring cultural resonance while maintaining brand consistency. This work required exactly the rigour you describe: balancing linguistic excellence with commercial and timeline pressures, and knowing when cultural nuance matters most.\n\nI bring genuine curiosity about AI-driven language technologies. My recent AI Project Management bootcamp at neuefische GmbH included hands-on work with ML pipeline development, data manipulation, and understanding how large language models can be evaluated and deployed effectively. I am comfortable communicating technical concepts to diverse audiences and have the change mindset required to pilot new tools while safeguarding craft. I see AI not as a threat to linguistic quality but as an opportunity to scale excellence—precisely the balance this role demands.\n\nLiving in Germany since 2018, I have developed deep cultural fluency in the DACH region. I use German daily in my professional role as an English educator, and I understand the subtle differences in how German, Austrian and Swiss audiences engage with language and media. As a published author who has brought South African folklore to international readers through Penguin Random House, I also understand what it means to make stories resonate across cultural boundaries—the very essence of what Netflix's Globalisation team does at scale.\n\nMy experience extends to digital product contexts. At Software & Support Media, I managed content across web platforms, ensuring consistency in editorial voice while optimising for user engagement. I understand that language choices in UI and UX directly impact accessibility and usability, and I am comfortable collaborating with product and engineering teams to ensure linguistic decisions support the broader member experience.\n\nI am drawn to Netflix's approach of treating each market differently rather than simply translating. The opportunity to champion linguistic quality while leading the transformation of how language is built at scale is genuinely exciting. I would welcome the chance to discuss how my linguistic expertise, cultural knowledge and openness to innovation can contribute to the DACH member experience.\n\nThank you for considering my application.\n\nWarm regards,\n\nCharles Siboto"
  },
  {
    "id": "publishing_001",
    "company": "Loewe Verlag",
    "role": "Rights Manager",
    "industry": "publishing",
    "date": "2025-12-15",
    "status": "rejected",
    "notes": "Personalized rejection by Lisa-Marie Röller - CLOSEST CALL",
    "letter": "Charles Siboto\nNeu-Eichenberg, Germany\ncsiboto@gmail.com\n+49 176 8787 3255\n\n15 December 2025\n\nDear Hiring Manager,\n\nI am writing to express my strong interest in the Rights Manager position at Loewe Verlag. With a deep understanding of the full publishing lifecycle from commissioning through to delivery, I bring both editorial expertise and project management discipline to this role.\n\nAs a published author with Penguin Random House South Africa, I understand the creative process from both sides. My Kwasuka Sukela fairy tale series celebrates African cultures and has given me firsthand experience with rights considerations, international co-productions, and the importance of protecting creative work.\n\nAt NB Publishers, I oversaw co-production projects with international publishers, managing translation, design coordination, and cross-border approvals. At Jonathan Ball Publishers, I delivered 20+ titles annually while coordinating with authors, designers, and production teams.\n\nI am particularly drawn to Loewe Verlag's commitment to children's and young adult literature—an area where I have both professional experience and personal passion.\n\nI am available from 01 February 2026, and my salary expectation is in the range of €52,000 to €58,000 annually.\n\nWarm regards,\n\nCharles Siboto"
  },
  {
    "id": "publishing_002",
    "company": "Springer Nature",
    "role": "Product Manager (Preprints)",
    "industry": "scientific_publishing",
    "date": "2026-01-13",
    "status": "rejected",
    "cv_version": "Product Manager",
    "notes": "Need academic/research background",
    "letter": "Charles Siboto\nNeu-Eichenberg, Germany\ncsiboto@gmail.com\n+49 176 8787 3255\nlinkedin.com/in/charlessiboto-2a9a773b\n\n13 January 2026\n\nDear Hiring Team,\n\nI am writing to apply for the Product Manager (Preprints) position at Springer Nature. With over ten years of experience in publishing and digital content management, combined with recent certification in Agile Scrum methodology, I am excited by the opportunity to shape how researchers discover, publish and manage preprints through Research Square.\n\nMy career has been built at the intersection of publishing, digital products and user-focused content strategy. At Jonathan Ball Publishers, I managed 20+ book titles annually through the complete product lifecycle, from manuscript acquisition to market release, coordinating editorial, design and production teams to deliver on time and within budget. At NB Publishers, I led digital publishing initiatives, releasing 20+ EPUB/MOBI titles annually and overseeing international co-production projects. This experience has given me a deep understanding of how to balance editorial quality, commercial objectives and user needs—skills directly applicable to developing preprint products that serve both researchers and Springer Nature's strategic goals.\n\nI bring practical experience in data-led product thinking. As Online Editor at Software & Support Media, I developed content strategies aligned with marketing campaigns, implemented metrics to track audience engagement, and iteratively optimised our digital presence based on performance data. My recent AI Project Management bootcamp at neuefische GmbH deepened my expertise in Agile methodologies, user research techniques, and working embedded within development teams—precisely the approach this role requires for delivering customer value iteratively.\n\nStakeholder management and cross-functional collaboration are strengths I have developed throughout my career. Whether coordinating with international publishers on translation projects, facilitating workshops and events, or working with authors to develop market-ready content, I have consistently demonstrated the ability to align diverse perspectives toward shared goals. I am comfortable influencing without authority and facilitating timely decision-making across editorial, technical and commercial stakeholders.\n\nSpringer Nature's mission to open doors to discovery resonates strongly with me. As a published author myself, I understand the researcher's journey and the value of making work accessible to the wider scientific community. I would welcome the opportunity to contribute to products that help researchers share their findings earlier and more effectively.\n\nI am available to start from April 2026 and am open to relocating to any of the listed locations, including Berlin. Thank you for considering my application. I look forward to the opportunity to discuss how my publishing and product management experience can contribute to Springer Nature's preprints strategy.\n\nWarm regards,\n\nCharles Siboto"
  }
]
